Revit 2026 API

# ProjectInfoClientName Property

---

Get or Set the Client Name of the Project Information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ClientName { get; set; }
```
```vb
Public Property ClientName As String
	Get
	Set
```
```cpp
public:
property String^ ClientName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ClientName : string with get, set
```

#### Property Value

String

This property is used to get or set the Project Client Name of the Project Information.

#### Reference

ProjectInfo Class

Autodesk.Revit.DB Namespace